# LogInteger Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..LogInteger Property
TessellatedShapeBuilder Class See Also
---
Integer value used for logging, if it is performed. Usually the number of the face set(s) in the IFC file, from which they are imported. Any value is acceptable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int LogInteger { get; set; }
```

Visual Basic
---
```text
Public Property LogInteger As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int LogInteger {
	int get ();
	void set (int value);
}
```

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace